Тест/Тест/src/Documents/КадровыйПриказ/КадровыйПриказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровыйПриказ</name>
  <registerRecords>InformationRegister.дт_НачисленияФиксированныеПлан</registerRecords>
  <registerRecords>InformationRegister.ДолжностиСотрудников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>CatalogRef.ТипыКадровыхДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мотивация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОформления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДоговора</name>
      <type>
        <types>CatalogRef.ТипыКадровыхДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Надбавки</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>CatalogRef.дт_ВидыРасчетовЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/InformationRegisters/АналитикаВакансий/АналитикаВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаВакансий</name>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КадровыйПриказ</name>
    <type>
      <types>DocumentRef.КадровыйПриказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Увольнение</name>
    <type>
      <types>DocumentRef.УвольненияСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.ВакансииКампании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Catalogs/Подразделения/Подразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подразделения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ЭтоЦФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроценОтВыручки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Премия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПерезаписывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкладСуммаУправлениеиОтдел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоходОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПремияОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроценОтВыручкиОбщий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудниковОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПремиальныйФонд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремиальныйФонд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтделДДС</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мотивация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Catalogs/ВакансииКампании/ВакансииКампании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВакансииКампании</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолженЗнать</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Интервьюеры</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Documents/КадровыйПриказ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//Если Параметры.Сотрудник  <> Справочники.Сотрудники.ПустаяСсылка() Тогда
	//	Объект.Сотрудник = Параметры.Сотрудник;
	//КонецЕсли;
	доступностьОтделов();
	заполнениеСпискаЦФО();
   // заполнениеСпискаОтделов();
    заполнениеСпискаДолжностей();
	Получитькомпоненту(); 
	Элементы.QRКод.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
КонецПроцедуры 
 &НаСервере
Функция СсылкаОргструктура()
//++МазинЕС 23.05.24	
 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	Подразделения.Ссылка КАК Ссылка
 	|ИЗ
 	|	Справочник.Подразделения КАК Подразделения
 	|ГДЕ
 	|	Подразделения.Код = &Код";
 Запрос.УстановитьПараметр("Код","000000105");
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	Возврат ВыборкаДетальныеЗаписи.Ссылка;
 КонецЦикла;
//++МазинЕС 23.05.24
 КонецФункции

 &НаКлиенте
 Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
 	ПередЗаписьюНаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ПередЗаписьюНаСервере()
 	
 	///+ТатарМА 27.09.2024
 	Если Объект.Вакансия <> Справочники.ВакансииКампании.ПустаяСсылка() И Объект.Вакансия.Статус = Истина Тогда
 		ОбъектВакансии = Справочники.ВакансииКампании.НайтиПоКоду(Объект.Вакансия.Код).ПолучитьОбъект();
 		ОбъектВакансии.ДатаЗакрытия = ТекущаяДатаСеанса();
 		ОбъектВакансии.Статус = Ложь;
 		ОбъектВакансии.Записать();
 	КонецЕсли;
 	///-ТатарМА 27.09.2024
 	
 КонецПроцедуры

 
 &НаКлиенте
Функция ОбновитьФормуСписка()
	 //++Мазин 22.05.24
	Попытка 
	СтруктураРезультатов = ЗапросСотрудникиВСправочникеПодразделения();
	СсылкаНаОбъект = СтруктураРезультатов.СсылкаПодразделение;
	Форма1 = ПолучитьФорму("Справочник.Подразделения.Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъект));
	Форма1.Записать();
	Исключение
	КонецПопытки;
	СсылкаНаОбъект = Объект.Отдел;
	Форма = ПолучитьФорму("Справочник.Подразделения.Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъект));
	Форма.Записать();
	
	СсылкаНаОбъект= СсылкаОргструктура();
	Форма2 = ПолучитьФорму("Справочник.Подразделения.Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъект));
	Форма2.Записать();
 //--Мазин 22.05.24
КонецФункции
 
&НаСервере
 Функция ЗапросСотрудникиВСправочникеПодразделения()
 //++Мазин 14.05.24

 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	Сотрудники.Пользователь КАК ПользовательСотр,
 	|	Подразделения.Ссылка КАК СсылкаПодразделение
 	|ИЗ
 	|	Справочник.Подразделения КАК Подразделения
 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
 	|		ПО Подразделения.Участники.Сотрудник = Сотрудники.Пользователь
 	|ГДЕ
 	|	Сотрудники.Ссылка = &Ссылка";
 
 Запрос.УстановитьПараметр("Ссылка", Объект.Сотрудник);
 
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 СтруктураРезультатов = Новый Структура;
 
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 СтруктураРезультатов.Вставить("СсылкаПодразделение",ВыборкаДетальныеЗаписи.СсылкаПодразделение );	
 СтруктураРезультатов.Вставить("ПользовательСотр",ВыборкаДетальныеЗаписи.ПользовательСотр );
 КонецЦикла; 	
 	 
 		Если СтруктураРезультатов.Свойство("СсылкаПодразделение") Тогда
   			 	Если СтруктураРезультатов.СсылкаПодразделение <> Объект.Отдел  Тогда	
 					УдолитьСотрудникаВСправочникеПодразделения(СтруктураРезультатов);
 					ДобавитьСотрудникаВСправочникеПодразделения(СтруктураРезультатов);
   			 	КонецЕсли;	
 		Иначе ДобавитьСотрудникаВСправочникеПодразделения(СтруктураРезультатов); 
 		КонецЕсли;	
Возврат СтруктураРезультатов; 
 //--Мазин 14.05.24
 КонецФункции

&НаСервере
 Процедура УдолитьСотрудникаВСправочникеПодразделения(СтруктураРезультатов)
 //++Мазин 15.05.24
 СсылкаНаОбъект = СтруктураРезультатов.СсылкаПодразделение;
 ОбъектУчастники = СсылкаНаОбъект.ПолучитьОбъект(); 

 	 			Индекс = ОбъектУчастники.Участники.Количество() - 1;
				Пока Индекс >= 0 Цикл
    			Если ОбъектУчастники.Участники[Индекс].Сотрудник = СтруктураРезультатов.ПользовательСотр Тогда
    				ОбъектУчастники.Участники.Удалить(Индекс);
    				ОбъектУчастники.Записать();
    			КонецЕсли;
    				Индекс = Индекс - 1;
				КонецЦикла;

 КонецПроцедуры

 &НаСервере
 Процедура ДобавитьСотрудникаВСправочникеПодразделения(СтруктураРезультатов)
 //++Мазин 16.05.24

 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	Сотрудники.Пользователь КАК СотрудникПользователь
 	|ИЗ
 	|	Справочник.Сотрудники КАК Сотрудники
 	|ГДЕ
 	|	Сотрудники.Ссылка = &Ссылка";
 
 Запрос.УстановитьПараметр("Ссылка", Объект.Сотрудник);
 
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	СотрудникПользователь = ВыборкаДетальныеЗаписи.СотрудникПользователь;
 КонецЦикла;
 

 СсылкаНаОбъект = Объект.Отдел;
 ОбъектУчастники = СсылкаНаОбъект.ПолучитьОбъект();
НоваяСтрока =ОбъектУчастники.Участники.Добавить(); 
НоваяСтрока.Сотрудник = СотрудникПользователь; 
ОбъектУчастники.Записать();

 КонецПроцедуры

&НаСервере
Процедура Получитькомпоненту()
	ТекстОшибки = "";
	
	Штрихкод =  ГенераторШтрихКода.ПолучитьКомпонентуШтрихКодирования(ТекстОшибки); 
	Штрихкод.Ширина = 250; 
	Штрихкод.Высота = 250;
	Штрихкод.ТипКода = 16;
	Штрихкод.УголПоворота = 0;
	Штрихкод.ЗначениеКода = "{ ""id_doc"":"+ """" + Объект.Номер + """" + ",""type"":" +" ""КадровыйПриказ""}";
	Штрихкод.ПрозрачныйФон = Истина;
	Штрихкод.ОтображатьТекст = Ложь;
	
	ДвоичныйШтрихКод = штрихкод.ПолучитьШтрихКод();
	КартинкаШтрихКод = Новый Картинка(ДвоичныйШтрихКод,Истина);
	
	QRкод = ПоместитьВоВременноеХранилище(КартинкаШтрихКод,УникальныйИдентификатор);
	//возврат истина;
КонецПроцедуры
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//++Мазин 16-05-24
	ОбновитьФормуСписка();
	//ЗапросСотрудникиВСправочникеПодразделения();
//--Мазин 16-05-24
	
	ПослеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()

	///+ТатарМА 27.09.2024
	ЗаписьВРегистреСведений 			= РегистрыСведений.АналитикаВакансий.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.Вакансия 	= Объект.Вакансия.Ссылка;
	ЗаписьВРегистреСведений.Прочитать();
		Если ЗаписьВРегистреСведений.Выбран() И ЗаписьВРегистреСведений.КадровыйПриказ = Документы.КадровыйПриказ.ПустаяСсылка() Тогда
			ЗаписьВРегистреСведений.ДатаЗакрытия 	= Объект.Дата;
			ЗаписьВРегистреСведений.КадровыйПриказ 	= Объект.Ссылка;
			ЗаписьВРегистреСведений.Сотрудник 		= Объект.Сотрудник;
			ЗаписьВРегистреСведений.ПериодПоиска 	= РаботаСДокументамиАналитикаВызовСервера.ПолучитьРазницуДат(Объект.Вакансия.ДатаСоздания, Объект.Вакансия.ДатаЗакрытия);
			ЗаписьВРегистреСведений.Записать();
		КонецЕсли;
	///-ТатарМА 27.09.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.Подразделения.Форма.ФормаВыбора" Тогда
		Элементы.Сотрудники.ТекущиеДанные.Подразделение = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Сотрудники

&НаКлиенте
Процедура СотрудникиПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//ПараметрыОткрытия = Новый Структура();
	//ПараметрыОткрытия.Вставить("ЦФО", Объект.ЦФО);
	//ПараметрыОткрытия.Вставить("ТекущаяСтрока", Элементы.Сотрудники.ТекущиеДанные.Подразделение);
	//
	//ОткрытьФорму("Справочник.Подразделения.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		Элементы.Сотрудники.ТекущиеДанные.Дата = Объект.Дата;
		
	КонецЕсли;
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

&НаСервере
Процедура заполнениеСпискаЦФО()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подразделения.Ссылка КАК Ссылка,
	               |	Подразделения.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |ГДЕ
	               |	Подразделения.Город = &Город";
	Запрос.УстановитьПараметр("Город",Объект.Город);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.ЦФО.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.ЦФО.СписокВыбора.Добавить(Выборка.ссылка,Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура заполнениеСпискаОтделов()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подразделения.Ссылка КАК Ссылка,
	               |	Подразделения.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Подразделения КАК Подразделения
	               |ГДЕ
	               |	Подразделения.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель",Объект.ЦФО);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.Отдел.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Отдел.СписокВыбора.Добавить(Выборка.ссылка,Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура заполнениеСпискаДолжностей()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДолжностиПредприятия.Ссылка КАК Ссылка,
	|	ДолжностиПредприятия.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Подразделения.Должности КАК ПодразделенияДолжности
	|		Внутреннее СОЕДИНЕНИЕ Справочник.ДолжностиПредприятия КАК ДолжностиПредприятия
	|		ПО ПодразделенияДолжности.Должность = ДолжностиПредприятия.Ссылка
	|ГДЕ
	|	 ПодразделенияДолжности.Ссылка = &отдел";
	Запрос.УстановитьПараметр("Отдел",Объект.Отдел);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.Должность.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Должность.СписокВыбора.Добавить(Выборка.ссылка,Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура доступностьОтделов()
	//Элементы.ЦФО.Доступность = ЗначениеЗаполнено(Объект.Город);
	//Элементы.Отдел.Доступность = ЗначениеЗаполнено(Объект.ЦфО);
	//Элементы.Должность.Доступность = ЗначениеЗаполнено(Объект.Отдел);
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	заполнениеСпискаЦФО();
	доступностьОтделов();
КонецПроцедуры

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	//заполнениеСпискаОтделов();
	доступностьОтделов();
КонецПроцедуры

&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	заполнениеСпискаДолжностей();
	доступностьОтделов();
КонецПроцедуры


	

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
